########### lab4-1

Cisco Packet Tracer PC Command Line 1.0
C:\>ipconfig /all
C:\>  tracert 10.10.1.18
C:\>ipconfig /all
C:\>ping 10.10.1.98
C:\>tracert 10.10.1.98
R1>show ip interface brief
R1>show ip route
R3>en
R3#show ip interface brief
R3#show ip route
R3#
User Access Verification

Password: 

R2>show ip interface brief
R2>en
Password: 
R2#show ip interface brief
R2#show ip interface brief
R2#config t
R2(config)#int s0/0/0
R2(config-if)#ip address 10.10.1.5 255.255.255.252
R2(config-if)#
%DUAL-5-NBRCHANGE: IP-EIGRP 1: Neighbor 10.10.1.6 (Serial0/0/0) is up: new adjacency

R2(config-if)#no shut down
R2(config-if)#exit
C:\>ping 10.10.1.98
C:\>ipv6config /all
C:\>ipv6config /all
C:\>tracert 2001:DB8:1:4::2
C:\>tracert 2001:DB8:1:1::2
C:\>ping 2001:DB8:1:4::2
C:\>ping 2001:DB8:1:1::2


########### lab4-2


C:\>ipconfig /all
C:\>ping 172.16.1.1
C:\>ping 209.165.201.2
C:\>ping 172.16.1.4
C:\>ping 172.16.2.3
C:\>ping 172.16.2.4
C:\>ipconfig /all
C:\>ping 172.16.1.1
C:\>ping 209.165.201.2
C:\>ping 172.16.1.3
C:\>ping 172.16.2.3
C:\>ping 172.16.2.4
C:\>ipconfig /all
C:\>ping 209.165.201.2
C:\>ping 172.16.2.1
C:\>ping 172.16.2.4
C:\>ping 172.16.1.3
C:\>ping 172.16.1.4
C:\>SSH -l Admin01 172.16.1.1
C:\>ipconfig /all
C:\>ping 209.165.201.2
C:\>ping 172.16.2.1
C:\>ping 172.16.2.3
C:\>ping  172.16.1.3
C:\>ping 172.16.1.4



########### lab4-3



R2>en
R2 #conf t
Enter configuration commands, one per line. End with CNTL/Z. 
R2 (config)#ip access-list standard R2NAT
R2 (config-std-nacl) #permit 192.168.10.0 0.0.0.255 
R2 (config-std-nacl) #permit 192.168.20.0 0.0.0.255
R2 (config-std-nacl) #permit 192.168.30.0 0.0.0.255
R2 (config-std-nacl) #exit
R2 (config)#ip nat pool R2 POOL 209.165.202.129 209.165.202.129 netmask 255.255.255.252
R2 (config)#ip nat inside source list R2NAT pool R2 POOL overload 
R2 (config)#int s0/1/0
R2 (config-if)#ip nat outside
R2(config-if)#exit
R2 (config)#int s0/0/1
R2 (config-if)#ip nat inside
R2 (config-if)#exit
R2 (config) #int s0/0/0
R2 (config-if)#ip nat inside
R2 (config-if)#exit
R2 (config)#int f0/0
R2 (config-if)#ip nat inside
R2 (config-if)#exit
R2 (config)#ip nat inside source static 192.168.20.254
209.165.202.130
R2 (config)#exit
R2#
%SYS-5-CONFIG_I: Configured from console by console
R2# show ip nat translatations




########### lab5-1

R1>en
R1#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
* - candidate default, U - per-user static route, o - ODR
P - periodic downloaded static route
Gateway of last resort is not set
172.31.0.0/16 is variably subnetted, 4 subnets, 3 masks
C 172.31.1.0/25 is directly connected, GigabitEthernet0/0
L 172.31.1.1/32 is directly connected, GigabitEthernet0/0
C 172.31.1.192/30 is directly connected, Serial0/0/0
L 172.31.1.194/32 is directly connected, Serial0/0/0
R1#conf t
Enter configuration commands, one per line. End with CNTL/Z.
R1(config)#ip route 172.31.0.0 255.255.255.0 172.31.1.193
R1(config)#ip route 172.31.1.128 255.255.255.192 172.31.1.193
R1(config)#ip route 172.31.1.196 255.255.255.0 172.31.1.193
%Inconsistent address and mask
R1(config)#ip route 172.31.1.196 255.255.255.252 172.31.1.193
R1(config)#show ip route
^
% Invalid input detected at '^' marker.
	
R1(config)#exit
R1#
%SYS-5-CONFIG_I: Configured from console by console
R1#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
* - candidate default, U - per-user static route, o - ODR
P - periodic downloaded static route
Gateway of last resort is not set
172.31.0.0/16 is variably subnetted, 7 subnets, 5 masks
S 172.31.0.0/24 [1/0] via 172.31.1.193
C 172.31.1.0/25 is directly connected, GigabitEthernet0/0
L 172.31.1.1/32 is directly connected, GigabitEthernet0/0
S 172.31.1.128/26 [1/0] via 172.31.1.193
C 172.31.1.192/30 is directly connected, Serial0/0/0
L 172.31.1.194/32 is directly connected, Serial0/0/0
S 172.31.1.196/30 [1/0] via 172.31.1.193
R1#



R2>en
R2#conf t
Enter configuration commands, one per line. End with CNTL/Z.
R2(config)#ip route 172.31.1.0 255.255.255.128 s0/0/0
%Default route without gateway, if not a point-to-point interface, may impact performance
R2(config)#ip route 172.31.1.128 255.255.255.192 s0/0/1
%Default route without gateway, if not a point-to-point interface, may impact performance
R2(config)#
R2(config)#exit
R2#
%SYS-5-CONFIG_I: Configured from console by console
R2#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
* - candidate default, U - per-user static route, o - ODR
P - periodic downloaded static route
Gateway of last resort is not set
172.31.0.0/16 is variably subnetted, 8 subnets, 5 masks
C 172.31.0.0/24 is directly connected, GigabitEthernet0/0
L 172.31.0.1/32 is directly connected, GigabitEthernet0/0
S 172.31.1.0/25 is directly connected, Serial0/0/0
S 172.31.1.128/26 is directly connected, Serial0/0/1
C 172.31.1.192/30 is directly connected, Serial0/0/0
L 172.31.1.193/32 is directly connected, Serial0/0/0
C 172.31.1.196/30 is directly connected, Serial0/0/1
L 172.31.1.197/32 is directly connected, Serial0/0/1
R2#


R3>en
R3#conf t
Enter configuration commands, one per line. End with CNTL/Z.
R3(config)#ip route 0.0.0.0 0.0.0.0 s0/0/1
%Default route without gateway, if not a point-to-point interface, may impact performance
R3(config)#exit
R3#
%SYS-5-CONFIG_I: Configured from console by console
R3#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
* - candidate default, U - per-user static route, o - ODR
P - periodic downloaded static route
Gateway of last resort is 0.0.0.0 to network 0.0.0.0
172.31.0.0/16 is variably subnetted, 4 subnets, 3 masks
C 172.31.1.128/26 is directly connected, GigabitEthernet0/0
L 172.31.1.129/32 is directly connected, GigabitEthernet0/0
C 172.31.1.196/30 is directly connected, Serial0/0/1
L 172.31.1.198/32 is directly connected, Serial0/0/1
S* 0.0.0.0/0 is directly connected, Serial0/0/1
R3#



############ lab5-2


Cisco Packet Tracer PC Command Line 1.0
C:\>tracert 192.0.0.10
Tracing route to 192.0.0.10 over a maximum of 30 hops:
1 0 ms 0 ms 0 ms 192.168.10.1
2 0 ms * 0 ms 192.168.10.1
3 * 0 ms * Request timed out.
4 0 ms
Control-C
^C
C:\>tracert 198.0.0.10
Tracing route to 198.0.0.10 over a maximum of 30 hops:
1 0 ms 0 ms 0 ms 192.168.10.1
2 0 ms * 0 ms 192.168.10.1
3 * 0 ms * Request timed out.
4 0 ms * 0 ms 192.168.10.1
5 * 0 ms
Control-C
^C
C:\>tracert 198.0.0.10
Tracing route to 198.0.0.10 over a maximum of 30 hops:
1 0 ms 0 ms 0 ms 192.168.10.1
2 0 ms 2 ms 2 ms 10.10.10.1
3 * 0 ms 1 ms 198.0.0.10
Trace complete.
C:\>tracert 2001.DB8:F:F::10
Tracert request could not find host 2001.DB8:F:F::10. Please check the name and try again.
C:\>tracert 2001:DB8:F:F::10
Tracing route to 2001:DB8:F:F::10 over a maximum of 30 hops:
1 0 ms 0 ms 0 ms 2001:DB8:1:10::1
2 3 ms 0 ms 0 ms 2001:DB8:A:1::1
3 1 ms 1 ms 0 ms 2001:DB8:F:F::10
Trace complete.
C:\>tracert 2001:DB8:F:F::10
Tracing route to 2001:DB8:F:F::10 over a maximum of 30 hops:
1 0 ms 0 ms 0 ms 2001:DB8:1:10::1
2 7 ms 1 ms 1 ms 2001:DB8:A:2::1
3 0 ms 1 ms 1 ms 2001:DB8:F:F::10
Trace complete.
C:\>




Edge_Router>en
Edge_Router#conf t
Enter configuration commands, one per line. End with CNTL/Z.
Edge_Router(config)#ip route 0.0.0.0 0.0.0.0 se0/0/0
%Default route without gateway, if not a point-to-point interface, may impact performance
Edge_Router(config)#exit
Edge_Router#
%SYS-5-CONFIG_I: Configured from console by console
Edge_Router#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
* - candidate default, U - per-user static route, o - ODR
P - periodic downloaded static route
Gateway of last resort is 0.0.0.0 to network 0.0.0.0
10.0.0.0/8 is variably subnetted, 4 subnets, 2 masks
C 10.10.10.0/30 is directly connected, Serial0/0/0
L 10.10.10.2/32 is directly connected, Serial0/0/0
C 10.10.10.4/30 is directly connected, Serial0/0/1
L 10.10.10.6/32 is directly connected, Serial0/0/1
192.168.10.0/24 is variably subnetted, 2 subnets, 2 masks
C 192.168.10.0/24 is directly connected, GigabitEthernet0/0
L 192.168.10.1/32 is directly connected, GigabitEthernet0/0
192.168.11.0/24 is variably subnetted, 2 subnets, 2 masks
C 192.168.11.0/24 is directly connected, GigabitEthernet0/1
L 192.168.11.1/32 is directly connected, GigabitEthernet0/1
S* 0.0.0.0/0 is directly connected, Serial0/0/0
--More-- 

Edge_Router#conf t
Enter configuration commands, one per line. End with CNTL/Z.
Edge_Router(config)#int se0/0/0
Edge_Router(config-if)#no shut
Edge_Router(config-if)#
%LINK-5-CHANGED: Interface Serial0/0/0, changed state to up
Edge_Router(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0/0, changed state to up
Edge_Router(config-if)#exit
Edge_Router(config)#exit
Edge_Router#
%SYS-5-CONFIG_I: Configured from console by console
Edge_Router#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
* - candidate default, U - per-user static route, o - ODR
P - periodic downloaded static route
Gateway of last resort is 0.0.0.0 to network 0.0.0.0
10.0.0.0/8 is variably subnetted, 4 subnets, 2 masks
C 10.10.10.0/30 is directly connected, Serial0/0/0
L 10.10.10.2/32 is directly connected, Serial0/0/0
C 10.10.10.4/30 is directly connected, Serial0/0/1
L 10.10.10.6/32 is directly connected, Serial0/0/1
192.168.10.0/24 is variably subnetted, 2 subnets, 2 masks
C 192.168.10.0/24 is directly connected, GigabitEthernet0/0
L 192.168.10.1/32 is directly connected, GigabitEthernet0/0
192.168.11.0/24 is variably subnetted, 2 subnets, 2 masks
C 192.168.11.0/24 is directly connected, GigabitEthernet0/1
L 192.168.11.1/32 is directly connected, GigabitEthernet0/1
S* 0.0.0.0/0 is directly connected, Serial0/0/0
Edge_Router#
Edge_Router#
Edge_Router#
Edge_Router#
Edge_Router#
Edge_Router#
Edge_Router#conf t
Enter configuration commands, one per line. End with CNTL/Z.
Edge_Router(config)#ipv6 uni
Edge_Router(config)#ipv6 unicast-routing
Edge_Router(config)#ipv6 route ::/0 2001:DB8:A:2::1 5
Edge_Router(config)#exit
Edge_Router#
%SYS-5-CONFIG_I: Configured from console by console
Edge_Router#show ipv6 route
IPv6 Routing Table - 10 entries
Codes: C - Connected, L - Local, S - Static, R - RIP, B - BGP
U - Per-user Static route, M - MIPv6
I1 - ISIS L1, I2 - ISIS L2, IA - ISIS interarea, IS - ISIS summary
ND - ND Default, NDp - ND Prefix, DCE - Destination, NDr - Redirect
O - OSPF intra, OI - OSPF inter, OE1 - OSPF ext 1, OE2 - OSPF ext 2
ON1 - OSPF NSSA ext 1, ON2 - OSPF NSSA ext 2
D - EIGRP, EX - EIGRP external
S ::/0 [1/0]
via 2001:DB8:A:1::1
C 2001:DB8:1:10::/64 [0/0]
via GigabitEthernet0/0, directly connected
L 2001:DB8:1:10::1/128 [0/0]
via GigabitEthernet0/0, receive
C 2001:DB8:1:11::/64 [0/0]
via GigabitEthernet0/1, directly connected
L 2001:DB8:1:11::1/128 [0/0]
via GigabitEthernet0/1, receive
C 2001:DB8:A:1::/64 [0/0]
via Serial0/0/0, directly connected
L 2001:DB8:A:1::2/128 [0/0]
via Serial0/0/0, receive
C 2001:DB8:A:2::/64 [0/0]
via Serial0/0/1, directly connected
L 2001:DB8:A:2::2/128 [0/0]
via Serial0/0/1, receive
L FF00::/8 [0/0]
via Null0, receive
Edge_Router#
Edge_Router#
Edge_Router#
Edge_Router#
Edge_Router#
Edge_Router#
Edge_Router#
Edge_Router#
Edge_Router#
Edge_Router#
Edge_Router#
Edge_Router#
Edge_Router#
Edge_Router#conf t
Enter configuration commands, one per line. End with CNTL/Z.
Edge_Router(config)#int se0/0/0
Edge_Router(config-if)#shut
Edge_Router(config-if)#
%LINK-5-CHANGED: Interface Serial0/0/0, changed state to administratively down
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial0/0/0, changed state to down
Edge_Router(config-if)#exit
Edge_Router(config)#exit
Edge_Router#
%SYS-5-CONFIG_I: Configured from console by console
Edge_Router#show ip route
Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
* - candidate default, U - per-user static route, o - ODR
P - periodic downloaded static route
Gateway of last resort is 0.0.0.0 to network 0.0.0.0
10.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C 10.10.10.4/30 is directly connected, Serial0/0/1
L 10.10.10.6/32 is directly connected, Serial0/0/1
192.168.10.0/24 is variably subnetted, 2 subnets, 2 masks
C 192.168.10.0/24 is directly connected, GigabitEthernet0/0
L 192.168.10.1/32 is directly connected, GigabitEthernet0/0
192.168.11.0/24 is variably subnetted, 2 subnets, 2 masks
C 192.168.11.0/24 is directly connected, GigabitEthernet0/1
L 192.168.11.1/32 is directly connected, GigabitEthernet0/1
S* 0.0.0.0/0 is directly connected, Serial0/0/1
Edge_Router#
Edge_Router#



########### lab5-03

R1>en
R1#conf t
Enter configuration commands, one per line. End with CNTL/Z.
R1(config)#ip route 0.0.0.0 0.0.0.0 s0/0/1
R1(config)#route rip
R1(config-router)#version 2
R1(config-router)#no auto-summary
R1(config-router)#network 192.168.1.1
R1(config-router)#no network 192.168.1.1
R1(config-router)#network 192.168.1.0
R1(config-router)#network 192.168.2.0
R1(config-router)#passive-interface g0/0
R1(config-router)#default-information originate
R1(config-router)#end
R1#
%SYS-5-CONFIG_I: Configured from console by console
R1#show ip route
Gateway of last resort is 0.0.0.0 to network 0.0.0.0
192.168.1.0/24 is variably subnetted, 2 subnets, 2 masks
C 192.168.1.0/24 is directly connected, GigabitEthernet0/0
L 192.168.1.1/32 is directly connected, GigabitEthernet0/0
192.168.2.0/24 is variably subnetted, 2 subnets, 2 masks
C 192.168.2.0/24 is directly connected, Serial0/0/0
L 192.168.2.1/32 is directly connected, Serial0/0/0
209.165.200.0/24 is variably subnetted, 2 subnets, 2 masks
C 209.165.200.224/30 is directly connected, Serial0/0/1
L 209.165.200.225/32 is directly connected, Serial0/0/1
S* 0.0.0.0/0 is directly connected, Serial0/0/1
R1#show ip route rip
209.165.200.0/24 is variably subnetted, 2 subnets, 2 masks


R2>en
R2#conf t
Enter configuration commands, one per line. End with CNTL/Z.
R2(config)#router rip
R2(config-router)#version 2
R2(config-router)#no auto-summary
R2(config-router)#network 192.168.2.0
R2(config-router)#network 192.168.3.0
R2(config-router)#network 192.168.4.0
R2(config-router)#passive-interface g0/0
R2(config-router)#end
R2#
%SYS-5-CONFIG_I: Configured from console by console
R2#copy run start
Destination filename [startup-config]?
Building configuration...
[OK]
R2#

R3>en
R3#conf t
Enter configuration commands, one per line. End with CNTL/Z.
R3(config)#router rip
R3(config-router)#version 2
R3(config-router)#no auto-summary
R3(config-router)#do show ip route connected
C 192.168.4.0/24 is directly connected, Serial0/0/1
C 192.168.5.0/24 is directly connected, GigabitEthernet0/0
R3(config-router)#network 192.168.4.0
R3(config-router)#
R3(config-router)#network 192.168.5.0
R3(config-router)#passive-int g0/0
R3(config-router)#end
R3#
%SYS-5-CONFIG_I: Configured from console by console
R3#copy run start
Destination filename [startup-config]?
Building configuration...
[OK]
R3#


########### lab5-04

R1>
R1>en
R1#conf t
Enter configuration commands, one per line. End with CNTL/Z.
R1(config)#int g0/0
R1(config-if)#ip helper-address 10.1.1.2
R1(config-if)#


R2>
R2>en
R2#config
Configuring from terminal, memory, or network [terminal]?
Enter configuration commands, one per line. End with CNTL/Z.
R2(config)#ip dhcp excluded-address 192.168.10.1 192.168.10.10
R2(config)#ip dhcp excluded-address 192.168.30.1 192.168.30.10
R2(config)#ip dhcp pool R1-LAN
R2(dhcp-config)#network 192.168.10.0 255.255.255.0
R2(dhcp-config)#dns-server 192.168.20.254
R2(dhcp-config)#default-router 192.168.10.1
R2(dhcp-config)#exit
R2(config)#ip dhcp pool R3-LAN
R2(dhcp-config)#network 192.168.30.0 255.255.255.0
R2(dhcp-config)#dns-server 192.168.20.254
R2(dhcp-config)#default-router 192.168.30.1
R2(dhcp-config)#

R2>en
R2#conf t
Enter configuration commands, one per line. End with CNTL/Z.
R2(config)#int g0/1
R2(config-if)#ip address dhcp
R2(config-if)#exit	
R2(config)#exit
R2#show ip interface brief
Interface IP-Address OK? Method Status Protocol
GigabitEthernet0/0 192.168.20.1 YES manual up up
GigabitEthernet0/1 209.165.200.231 YES DHCP up up
Serial0/0/0 10.1.1.2 YES manual up up
Serial0/0/1 10.2.2.2 YES manual up up
Serial0/1/0 unassigned YES unset down down
Serial0/1/1 unassigned YES unset down down
Vlan1 unassigned YES unset administratively down down
R2#

R2#show ip dhcp binding
IP address Client-ID/ Lease expiration Type
Hardware address
192.168.10.11 0002.4AA5.1470 -- Automatic
192.168.30.11 0004.9A97.2535 -- Automatic
R2#


R3>
R3>en
R3#conf t
Enter configuration commands, one per line. End with CNTL/Z.
R3(config)#int g0/0
R3(config-if)#ip helper-address 10.2.2.2
R3(config-if)#



########### lab5-5

R1>
R1>en
R1#conf t
Enter configuration commands, one per line. End with CNTL/Z.
R1(config)#int g0/0
R1(config-if)#ip helper-address 192.168.60.253
R1(config-if)#

